#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.single_zone.data.archive_file.warmer_function[0]: Reading...
module.single_zone.data.archive_file.revalidation_function[0]: Reading...
module.single_zone.data.archive_file.image_optimisation_function[0]: Reading...
module.single_zone.data.archive_file.revalidation_function[0]: Read complete after 0s [id=c717d3aaf882643876d11c47680b945fe0192a3b]
module.single_zone.data.archive_file.warmer_function[0]: Read complete after 0s [id=e5094e337d97bf663bebb451657f5785a9dda36d]
module.http-redirect.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:615299762949:certificate/c69ccd6e-eece-4944-b5d5-e191ea5376aa]
module.single_zone.module.public_resources[0].data.aws_cloudfront_origin_request_policy.all_viewer_except_host_header: Reading...
module.single_zone.module.public_resources[0].data.aws_region.current: Reading...
module.single_zone.module.public_resources[0].data.aws_cloudfront_cache_policy.caching_optimized: Reading...
module.single_zone.module.public_resources[0].aws_cloudfront_function.x_forwarded_host: Refreshing state... [id=vltech-website-x-forwarded-host-function]
module.single_zone.module.public_resources[0].aws_cloudfront_origin_access_control.website_origin_access_control: Refreshing state... [id=E3RNQ0V4MAIQ68]
module.single_zone.module.public_resources[0].aws_cloudfront_cache_policy.cache_policy[0]: Refreshing state... [id=06efa7e0-f0db-4669-832e-5b76036eb9b1]
module.single_zone.module.public_resources[0].data.aws_region.current: Read complete after 0s [id=us-east-1]
module.single_zone.module.public_resources[0].data.aws_cloudfront_origin_request_policy.all_viewer_except_host_header: Read complete after 1s [id=b689b0a8-53d0-40ab-baf2-68738e2966ac]
module.single_zone.module.public_resources[0].data.aws_cloudfront_cache_policy.caching_optimized: Read complete after 1s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
module.single_zone.module.revalidation_function.data.aws_region.current: Reading...
module.single_zone.module.server_function.data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Reading...
module.http-redirect.data.aws_route53_zone.zone: Reading...
module.single_zone.module.image_optimisation_function[0].data.aws_region.current: Reading...
module.single_zone.module.server_function.data.aws_region.current: Reading...
module.single_zone.module.revalidation_function.data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.single_zone.module.server_function.aws_iam_role.lambda_iam: Refreshing state... [id=vltech-website-server-function-role]
module.single_zone.module.image_optimisation_function[0].data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.single_zone.module.server_function.data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.single_zone.data.aws_region.current: Reading...
module.single_zone.module.revalidation_function.aws_iam_role.lambda_iam: Refreshing state... [id=vltech-website-revalidation-function-role]
module.single_zone.data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.single_zone.module.revalidation_function.data.aws_caller_identity.current: Reading...
module.single_zone.module.image_optimisation_function[0].data.aws_caller_identity.current: Reading...
module.single_zone.aws_dynamodb_table.isr_table[0]: Refreshing state... [id=vltech-website-isr-tag-mapping]
module.single_zone.module.server_function.data.aws_caller_identity.current: Read complete after 0s [id=615299762949]
module.single_zone.aws_sqs_queue.revalidation_queue: Refreshing state... [id=https://sqs.eu-central-1.amazonaws.com/615299762949/vltech-website-isr-queue.fifo]
module.single_zone.module.image_optimisation_function[0].aws_iam_role.lambda_iam: Refreshing state... [id=vltech-website-image-optimization-function-role]
module.single_zone.module.open_next_aliases[0].aws_ssm_parameter.origin_aliases: Refreshing state... [id=vltech-website-website-origin-aliases]
data.aws_caller_identity.current: Read complete after 0s [id=615299762949]
module.single_zone.module.public_resources[0].data.aws_route53_zone.hosted_zone["victorlevasseur.tech-false"]: Reading...
module.http-redirect.data.aws_route53_zone.zone: Read complete after 0s [id=Z01305181G23H04WP32YA]
module.http-redirect.aws_cloudfront_function.redirect: Refreshing state... [id=http-redirect]
module.single_zone.aws_s3_bucket.bucket[0]: Refreshing state... [id=vltech-website-website-bucket]
module.single_zone.module.revalidation_function.data.aws_caller_identity.current: Read complete after 0s [id=615299762949]
module.http-redirect.aws_route53_record.cert_validation["victorlevasseur.tech"]: Refreshing state... [id=Z01305181G23H04WP32YA__abc41aced5334d86bdd43adac171c372.victorlevasseur.tech._CNAME]
module.single_zone.module.public_resources[0].data.aws_route53_zone.hosted_zone["victorlevasseur.tech-false"]: Read complete after 0s [id=Z01305181G23H04WP32YA]
module.single_zone.module.revalidation_function.aws_lambda_function.lambda_function: Refreshing state... [id=vltech-website-revalidation-function]
module.single_zone.module.revalidation_function.aws_cloudwatch_log_group.lambda_log_group[0]: Refreshing state... [id=/aws/lambda/vltech-website-revalidation-function]
module.single_zone.module.image_optimisation_function[0].data.aws_caller_identity.current: Read complete after 0s [id=615299762949]
module.http-redirect.aws_acm_certificate_validation.cert: Refreshing state... [id=2025-02-13 14:11:52.205 +0000 UTC]
module.single_zone.data.archive_file.image_optimisation_function[0]: Read complete after 1s [id=3cf831ded2704a9d8bb0a09ce8ca99eff0c0eea4]
module.single_zone.module.server_function.aws_cloudwatch_log_group.lambda_log_group[0]: Refreshing state... [id=/aws/lambda/vltech-website-server-function]
module.single_zone.module.image_optimisation_function[0].aws_cloudwatch_log_group.lambda_log_group[0]: Refreshing state... [id=/aws/lambda/vltech-website-image-optimization-function]
module.http-redirect.aws_cloudfront_distribution.distribution: Refreshing state... [id=E3AXV12PY17NPX]
module.single_zone.module.open_next_aliases[0].data.aws_ssm_parameter.origin_aliases: Reading...
module.single_zone.module.revalidation_function.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::615299762949:policy/vltech-website-revalidation-function-lambda-policy]
module.http-redirect.aws_route53_record.main["victorlevasseur.tech"]: Refreshing state... [id=Z01305181G23H04WP32YA_victorlevasseur.tech_A]
module.single_zone.module.open_next_aliases[0].data.aws_ssm_parameter.origin_aliases: Read complete after 1s [id=vltech-website-website-origin-aliases]
module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/layout-920w1QLo2qpKniSWhIQ1q/favicon.ico"]: Refreshing state... [id=fc401082-3340-6178-8dcf-acd9f169dc02]
module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/icon.svg"]: Refreshing state... [id=3b92ec73-4dcc-cf27-3f08-c6778692297e]
module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/layout-920w1QLo2qpKniSWhIQ1q/sitemap.xml"]: Refreshing state... [id=96c9f998-55e7-0473-a372-6ac891b07bbf]
module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/page"]: Refreshing state... [id=5f55e77a-ea68-715c-f2ac-0a59a24ef09c]
module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/layout-920w1QLo2qpKniSWhIQ1q/apple-icon.png"]: Refreshing state... [id=d7efbae8-881a-b656-7b05-a5ca07140334]
module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/_not-found/layout"]: Refreshing state... [id=b4b3b5c9-11ab-eaad-523a-060eaaf67296]
module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/sitemap.xml/layout"]: Refreshing state... [id=e5002440-ae65-91fd-f820-50b650ade1ff]
module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/"]: Refreshing state... [id=9c03f38e-06f2-6ad2-89e8-90575190b772]
module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/favicon.ico"]: Refreshing state... [id=b3270e2a-fdf6-075d-0521-fa463434b91b]
module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/icon.svg/route"]: Refreshing state... [id=d2033954-276f-b3dc-a397-78714be0b551]
module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/layout-920w1QLo2qpKniSWhIQ1q/icon.svg"]: Refreshing state... [id=ce959635-a787-6f7c-aa8e-cf39333d8d68]
module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/sitemap.xml/route"]: Refreshing state... [id=ef0b2660-2b02-d32d-cc95-0bb16321d4af]
module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/favicon.ico/layout"]: Refreshing state... [id=6052c073-5988-b67c-6131-c0eb50565852]
module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/layout-920w1QLo2qpKniSWhIQ1q/index"]: Refreshing state... [id=c39dac41-f1e2-4c8c-3d63-c40e5644b4fc]
module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/icon.svg/layout"]: Refreshing state... [id=596ef753-12ac-cbeb-e270-577263b514c5]
module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/sitemap.xml"]: Refreshing state... [id=24f3c7cd-7f29-1cf9-faef-aca924cede5a]
module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/_not-found/page"]: Refreshing state... [id=49a308d1-9874-bfb2-d39f-f423ea85ec24]
module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/_not-found"]: Refreshing state... [id=29e9dec1-feb9-bfa3-d4d3-5720306071b9]
module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/apple-icon.png/layout"]: Refreshing state... [id=6879ed4a-bdfd-d88d-b381-dac16244d648]
module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/layout-920w1QLo2qpKniSWhIQ1q/_not-found"]: Refreshing state... [id=e3936733-7b40-8338-b7d3-630643fcfaf2]
module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/apple-icon.png"]: Refreshing state... [id=47a19bfa-9d16-6c46-5061-81ba7ec8f273]
module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/apple-icon.png/route"]: Refreshing state... [id=27c4fd82-c25d-8596-0871-5f89d6a7dfab]
module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/favicon.ico/route"]: Refreshing state... [id=f6ae2f41-9820-ab2c-845a-684db4584073]
module.single_zone.module.revalidation_function.aws_lambda_alias.lambda_alias["stable"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-revalidation-function:stable]
module.single_zone.module.revalidation_function.aws_iam_role_policy_attachment.policy_attachment: Refreshing state... [id=vltech-website-revalidation-function-role-20241218205629363600000001]
module.single_zone.aws_lambda_event_source_mapping.revalidation_queue_source: Refreshing state... [id=23604771-f7d2-432b-ba67-c4d45c3c7817]
module.single_zone.module.revalidation_function.terraform_data.update_alias[0]: Refreshing state... [id=a6c5f47c-3c6f-57b1-0b03-e087f7d6719c]
module.single_zone.module.revalidation_function.aws_lambda_function_url.function_url["stable"]: Refreshing state... [id=vltech-website-revalidation-function/stable]
module.single_zone.module.image_optimisation_function[0].aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::615299762949:policy/vltech-website-image-optimization-function-lambda-policy]
module.single_zone.module.server_function.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::615299762949:policy/vltech-website-server-function-lambda-policy]
module.single_zone.module.image_optimisation_function[0].aws_lambda_function.lambda_function: Refreshing state... [id=vltech-website-image-optimization-function]
module.single_zone.data.archive_file.server_function[0]: Reading...
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/_not-found/page-0043d75de3bc49f5.js"]: Refreshing state... [id=431c59dc-b990-f5cf-efc4-d2777821eb00]
module.single_zone.module.s3_assets.terraform_data.file_sync["920w1QLo2qpKniSWhIQ1q/icon.svg.cache"]: Refreshing state... [id=8948703b-a2b3-650c-5a25-5389c6fa5441]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/css/2eeaa02267ae05a4.css"]: Refreshing state... [id=d53b2b03-50fc-268b-bc75-31068c325b1e]
module.single_zone.module.s3_assets.terraform_data.file_sync["window.svg"]: Refreshing state... [id=fea322f0-2d5a-7fbf-f75b-15a781be5d23]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/4bd1b696-095a8791bedde78b.js"]: Refreshing state... [id=396675ca-1f30-d993-ebe9-c97c2f3fec71]
module.single_zone.module.s3_assets.terraform_data.file_sync["920w1QLo2qpKniSWhIQ1q/index.cache"]: Refreshing state... [id=2ed45707-57ac-52a1-1332-235c4359661f]
module.single_zone.module.s3_assets.terraform_data.file_sync["920w1QLo2qpKniSWhIQ1q/apple-icon.png.cache"]: Refreshing state... [id=4ab22298-1947-a0a3-cc33-d814e62a661e]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/9bbb7f84f3601865-s.woff2"]: Refreshing state... [id=325d0d9e-b078-18a5-55c7-a53c90d5c6d5]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/main-app-d4c84837250c81b8.js"]: Refreshing state... [id=fbe0b5a6-0ff9-f248-fb8d-1f39b44a8105]
module.single_zone.module.s3_assets.terraform_data.file_sync["favicon.ico"]: Refreshing state... [id=d538d61d-dce0-cc44-df24-44711711892d]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/382b6f43e60580be-s.woff2"]: Refreshing state... [id=02cd3ae0-21e8-4118-e990-2aebe2360167]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/7bafef50a4560c1d-s.woff2"]: Refreshing state... [id=271e32ae-abf0-ca24-a29d-49260817d15a]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/page-6eedea7c280ebbc1.js"]: Refreshing state... [id=3092d8ac-7976-4b46-ed81-7d49618a24eb]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/framework-a6eb4bce5bd8ed9b.js"]: Refreshing state... [id=2e38b1f6-e9cc-8645-2869-3d55b50564e3]
module.single_zone.module.s3_assets.terraform_data.file_sync["file.svg"]: Refreshing state... [id=40d7329f-d154-8a03-5823-f80355a6142d]
module.single_zone.module.s3_assets.terraform_data.file_sync["920w1QLo2qpKniSWhIQ1q/_not-found.cache"]: Refreshing state... [id=e792b735-3e9a-be2d-71b4-25c4731245fc]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/main-8afb5c88d2340613.js"]: Refreshing state... [id=466372c9-168c-2f72-f31f-51cac8590e83]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/b32bc20a1e277f31-s.woff2"]: Refreshing state... [id=321d4549-ae06-3830-42eb-cfce7a6e73cf]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/9f05b6a2725a7318-s.woff2"]: Refreshing state... [id=ac4a618e-66ed-1415-d02d-9d88a4c281ad]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/layout-71b6fc99672c83d6.js"]: Refreshing state... [id=e5b733d6-4647-1696-c8c6-b470fd2515c0]
module.single_zone.module.s3_assets.terraform_data.file_sync["vercel.svg"]: Refreshing state... [id=bb14bb5d-dde9-bd1c-a554-c16a0cd13e4f]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/357398c3a461852b-s.woff2"]: Refreshing state... [id=e42276e7-9c0c-c131-fdcf-2a5abf5f7666]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/a8eac78432f0a60b-s.woff2"]: Refreshing state... [id=9e031051-5705-f03c-c644-4ca8b9261bf5]
module.single_zone.module.s3_assets.terraform_data.file_sync["globe.svg"]: Refreshing state... [id=60f4e56a-aabf-7501-3c3e-274d6c09a951]
module.single_zone.module.s3_assets.terraform_data.file_sync["920w1QLo2qpKniSWhIQ1q/sitemap.xml.cache"]: Refreshing state... [id=1c369268-3fd5-e077-1a09-3815d80ee7d7]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/4d1af68a2715a16a-s.p.woff2"]: Refreshing state... [id=e72e9c33-e3f8-1fde-1eb0-6a73205452e8]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/122c360d7fe6d395-s.p.woff2"]: Refreshing state... [id=674ad872-ee9b-89bd-9252-351607ab6caf]
module.single_zone.module.s3_assets.terraform_data.file_sync["920w1QLo2qpKniSWhIQ1q/500.cache"]: Refreshing state... [id=4e661c2a-5354-ee7d-81b3-22f2df1dd72a]
module.single_zone.module.s3_assets.terraform_data.file_sync["BUILD_ID"]: Refreshing state... [id=fd6eb316-4119-0da6-a5e6-ceef61c1e285]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/42aa6e6ea3b85651-s.woff2"]: Refreshing state... [id=59d3c0ee-ae3d-7390-a731-81f5168d647a]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/517-4007705705dbde3d.js"]: Refreshing state... [id=5e5e3e29-d3e6-a563-dca9-fd8f2a5d781a]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/css/9d4aa2bb10d1d993.css"]: Refreshing state... [id=b1d255f7-1fe7-67be-6085-37a0f528d327]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/920w1QLo2qpKniSWhIQ1q/_buildManifest.js"]: Refreshing state... [id=0a04cc66-2256-b7a6-5893-5ca384300b1c]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/pages/_error-9b7125ad1a1e68fa.js"]: Refreshing state... [id=75ef6842-85f2-603c-3c4b-cd67c9b9561f]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/pages/_app-d23763e3e6c904ff.js"]: Refreshing state... [id=a0a95740-9bd1-bbc5-3088-e6e5d18fff57]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/c740c1d45290834f-s.woff2"]: Refreshing state... [id=6c695a5c-d238-b55a-e737-abff99fcd32c]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/bc270b3a577192a7-s.woff2"]: Refreshing state... [id=16b8f0c3-94b5-168f-1fc9-f51adc0e8a3c]
module.single_zone.module.s3_assets.terraform_data.file_sync["920w1QLo2qpKniSWhIQ1q/favicon.ico.cache"]: Refreshing state... [id=f64b397c-c23c-8f76-46e8-4c81cc6cd3f0]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/920w1QLo2qpKniSWhIQ1q/_ssgManifest.js"]: Refreshing state... [id=128a8f55-1249-23ff-7b5f-1b2608667000]
module.single_zone.module.s3_assets.terraform_data.file_sync["next.svg"]: Refreshing state... [id=3a4c6e17-f8b6-1aa9-347a-25702f8ea170]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/polyfills-42372ed130431b0a.js"]: Refreshing state... [id=83abb4c2-13d6-9782-a9c9-1f886e23d3a1]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/webpack-1852367c91c26582.js"]: Refreshing state... [id=9572b7d9-d12a-8a49-1db6-5a6476060cce]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/d0697bdd3fb49a78-s.woff2"]: Refreshing state... [id=9076105b-745e-e65e-ec39-f64e126aac2e]
module.single_zone.module.server_function.aws_iam_role_policy_attachment.policy_attachment: Refreshing state... [id=vltech-website-server-function-role-20241218205750451600000001]
module.single_zone.module.image_optimisation_function[0].aws_iam_role_policy_attachment.policy_attachment: Refreshing state... [id=vltech-website-image-optimization-function-role-20241218205750570200000002]
module.single_zone.module.image_optimisation_function[0].aws_lambda_alias.lambda_alias["nextjs"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:nextjs]
module.single_zone.module.image_optimisation_function[0].aws_lambda_permission.function_url_permission[0]: Refreshing state... [id=terraform-20241218205755531800000003]
module.single_zone.module.image_optimisation_function[0].aws_lambda_alias.lambda_alias["opennext"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:opennext]
module.single_zone.module.image_optimisation_function[0].terraform_data.update_alias[0]: Refreshing state... [id=c861c6ea-fca5-3db8-a533-7b8aec2118ce]
module.single_zone.module.image_optimisation_function[0].aws_lambda_function_url.function_url["nextjs"]: Refreshing state... [id=vltech-website-image-optimization-function/nextjs]
module.single_zone.module.image_optimisation_function[0].aws_lambda_function_url.function_url["opennext"]: Refreshing state... [id=vltech-website-image-optimization-function/opennext]
module.single_zone.data.archive_file.server_function[0]: Read complete after 1s [id=fc907f999a1f33aeb15720247700410d30d86043]
module.single_zone.module.server_function.aws_lambda_function.lambda_function: Refreshing state... [id=vltech-website-server-function]
module.single_zone.module.server_function.aws_lambda_alias.lambda_alias["nextjs"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:nextjs]
module.single_zone.module.server_function.aws_lambda_alias.lambda_alias["opennext"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:opennext]
module.single_zone.module.server_function.aws_lambda_permission.function_url_permission[0]: Refreshing state... [id=terraform-20241218205803707400000004]
module.single_zone.module.server_function.terraform_data.update_alias[0]: Refreshing state... [id=fd943bb0-7ec6-03d0-ecbc-1166987a6b53]
module.single_zone.module.server_function.aws_lambda_function_url.function_url["opennext"]: Refreshing state... [id=vltech-website-server-function/opennext]
module.single_zone.module.server_function.aws_lambda_function_url.function_url["nextjs"]: Refreshing state... [id=vltech-website-server-function/nextjs]
module.single_zone.module.public_resources[0].aws_cloudfront_distribution.production_distribution[0]: Refreshing state... [id=EU3DKQFOTEI79]
module.single_zone.module.public_resources[0].aws_route53_record.route53_aaaa_record["victorlevasseur.tech-false"]: Refreshing state... [id=Z01305181G23H04WP32YA_www.victorlevasseur.tech_AAAA]
module.single_zone.module.public_resources[0].aws_route53_record.route53_a_record["victorlevasseur.tech-false"]: Refreshing state... [id=Z01305181G23H04WP32YA_www.victorlevasseur.tech_A]
module.single_zone.aws_s3_bucket_policy.bucket_policy[0]: Refreshing state... [id=vltech-website-website-bucket]
module.single_zone.terraform_data.update_aliases[0]: Refreshing state... [id=91801a6b-c186-471c-bbdc-f9817dca2a41]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/"] will be destroyed
  # (because key ["920w1QLo2qpKniSWhIQ1q/_N_T_/"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "9c03f38e-06f2-6ad2-89e8-90575190b772" -> null
      - triggers_replace = [
          - "nextjs",
          - "e4161ec1356823c7b806b1b286effd8e",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/_not-found"] will be destroyed
  # (because key ["920w1QLo2qpKniSWhIQ1q/_N_T_/_not-found"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "29e9dec1-feb9-bfa3-d4d3-5720306071b9" -> null
      - triggers_replace = [
          - "nextjs",
          - "e6ac39395b2be102cd2505f8702fbb54",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/_not-found/layout"] will be destroyed
  # (because key ["920w1QLo2qpKniSWhIQ1q/_N_T_/_not-found/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "b4b3b5c9-11ab-eaad-523a-060eaaf67296" -> null
      - triggers_replace = [
          - "nextjs",
          - "1dbfc21fec415561b46c07566d088e52",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/_not-found/page"] will be destroyed
  # (because key ["920w1QLo2qpKniSWhIQ1q/_N_T_/_not-found/page"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "49a308d1-9874-bfb2-d39f-f423ea85ec24" -> null
      - triggers_replace = [
          - "nextjs",
          - "b1d95ccadecc45507e95ca77cf6babff",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/apple-icon.png"] will be destroyed
  # (because key ["920w1QLo2qpKniSWhIQ1q/_N_T_/apple-icon.png"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "47a19bfa-9d16-6c46-5061-81ba7ec8f273" -> null
      - triggers_replace = [
          - "nextjs",
          - "3d8c6466d9bb99abca6d863b59cfd5ed",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/apple-icon.png/layout"] will be destroyed
  # (because key ["920w1QLo2qpKniSWhIQ1q/_N_T_/apple-icon.png/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "6879ed4a-bdfd-d88d-b381-dac16244d648" -> null
      - triggers_replace = [
          - "nextjs",
          - "f05fdbd0c5e2c1f6cfa986f733b79e98",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/apple-icon.png/route"] will be destroyed
  # (because key ["920w1QLo2qpKniSWhIQ1q/_N_T_/apple-icon.png/route"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "27c4fd82-c25d-8596-0871-5f89d6a7dfab" -> null
      - triggers_replace = [
          - "nextjs",
          - "d39ca577af872bf98307c0ac44ab8763",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/favicon.ico"] will be destroyed
  # (because key ["920w1QLo2qpKniSWhIQ1q/_N_T_/favicon.ico"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "b3270e2a-fdf6-075d-0521-fa463434b91b" -> null
      - triggers_replace = [
          - "nextjs",
          - "9f9d424d548be276fb22fa89f6aaae8b",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/favicon.ico/layout"] will be destroyed
  # (because key ["920w1QLo2qpKniSWhIQ1q/_N_T_/favicon.ico/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "6052c073-5988-b67c-6131-c0eb50565852" -> null
      - triggers_replace = [
          - "nextjs",
          - "64df9afdc8462c99af93e7a6d7334eb4",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/favicon.ico/route"] will be destroyed
  # (because key ["920w1QLo2qpKniSWhIQ1q/_N_T_/favicon.ico/route"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "f6ae2f41-9820-ab2c-845a-684db4584073" -> null
      - triggers_replace = [
          - "nextjs",
          - "83aab4203d563f02e125a3ce7cf38b71",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/icon.svg"] will be destroyed
  # (because key ["920w1QLo2qpKniSWhIQ1q/_N_T_/icon.svg"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "3b92ec73-4dcc-cf27-3f08-c6778692297e" -> null
      - triggers_replace = [
          - "nextjs",
          - "60d712b67cb840db95fc703a9b427fce",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/icon.svg/layout"] will be destroyed
  # (because key ["920w1QLo2qpKniSWhIQ1q/_N_T_/icon.svg/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "596ef753-12ac-cbeb-e270-577263b514c5" -> null
      - triggers_replace = [
          - "nextjs",
          - "126465d71c035427c47276b084a6dc07",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/icon.svg/route"] will be destroyed
  # (because key ["920w1QLo2qpKniSWhIQ1q/_N_T_/icon.svg/route"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "d2033954-276f-b3dc-a397-78714be0b551" -> null
      - triggers_replace = [
          - "nextjs",
          - "60f742ee2553f4236cb7e7f4da043979",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/layout-920w1QLo2qpKniSWhIQ1q/_not-found"] will be destroyed
  # (because key ["920w1QLo2qpKniSWhIQ1q/_N_T_/layout-920w1QLo2qpKniSWhIQ1q/_not-found"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "e3936733-7b40-8338-b7d3-630643fcfaf2" -> null
      - triggers_replace = [
          - "nextjs",
          - "db3cfe7d212f7ffeaad8c26ef2e1ff6b",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/layout-920w1QLo2qpKniSWhIQ1q/apple-icon.png"] will be destroyed
  # (because key ["920w1QLo2qpKniSWhIQ1q/_N_T_/layout-920w1QLo2qpKniSWhIQ1q/apple-icon.png"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "d7efbae8-881a-b656-7b05-a5ca07140334" -> null
      - triggers_replace = [
          - "nextjs",
          - "ace23213b4b8ea4a1797835ebbf07aa4",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/layout-920w1QLo2qpKniSWhIQ1q/favicon.ico"] will be destroyed
  # (because key ["920w1QLo2qpKniSWhIQ1q/_N_T_/layout-920w1QLo2qpKniSWhIQ1q/favicon.ico"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "fc401082-3340-6178-8dcf-acd9f169dc02" -> null
      - triggers_replace = [
          - "nextjs",
          - "edcc81a056d83477d18ce258c7874317",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/layout-920w1QLo2qpKniSWhIQ1q/icon.svg"] will be destroyed
  # (because key ["920w1QLo2qpKniSWhIQ1q/_N_T_/layout-920w1QLo2qpKniSWhIQ1q/icon.svg"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "ce959635-a787-6f7c-aa8e-cf39333d8d68" -> null
      - triggers_replace = [
          - "nextjs",
          - "e166fc023a456a5623c9a784fcb839ee",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/layout-920w1QLo2qpKniSWhIQ1q/index"] will be destroyed
  # (because key ["920w1QLo2qpKniSWhIQ1q/_N_T_/layout-920w1QLo2qpKniSWhIQ1q/index"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "c39dac41-f1e2-4c8c-3d63-c40e5644b4fc" -> null
      - triggers_replace = [
          - "nextjs",
          - "364c161fb928f379876fb61834a13ca8",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/layout-920w1QLo2qpKniSWhIQ1q/sitemap.xml"] will be destroyed
  # (because key ["920w1QLo2qpKniSWhIQ1q/_N_T_/layout-920w1QLo2qpKniSWhIQ1q/sitemap.xml"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "96c9f998-55e7-0473-a372-6ac891b07bbf" -> null
      - triggers_replace = [
          - "nextjs",
          - "51796be45bf4e4e659a927abbdf2efeb",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/page"] will be destroyed
  # (because key ["920w1QLo2qpKniSWhIQ1q/_N_T_/page"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "5f55e77a-ea68-715c-f2ac-0a59a24ef09c" -> null
      - triggers_replace = [
          - "nextjs",
          - "b54798c9bf1173d2c47d73857e2e15a7",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/sitemap.xml"] will be destroyed
  # (because key ["920w1QLo2qpKniSWhIQ1q/_N_T_/sitemap.xml"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "24f3c7cd-7f29-1cf9-faef-aca924cede5a" -> null
      - triggers_replace = [
          - "nextjs",
          - "c9404c603fad0657747ba2280ad8d303",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/sitemap.xml/layout"] will be destroyed
  # (because key ["920w1QLo2qpKniSWhIQ1q/_N_T_/sitemap.xml/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "e5002440-ae65-91fd-f820-50b650ade1ff" -> null
      - triggers_replace = [
          - "nextjs",
          - "3e198c824763fa27ff43e31d7d0f61e3",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["920w1QLo2qpKniSWhIQ1q/_N_T_/sitemap.xml/route"] will be destroyed
  # (because key ["920w1QLo2qpKniSWhIQ1q/_N_T_/sitemap.xml/route"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "ef0b2660-2b02-d32d-cc95-0bb16321d4af" -> null
      - triggers_replace = [
          - "nextjs",
          - "08a2417a216148ae3220b7d905b6ec5c",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["iFGJ9rUmIq_06R72t1nDu/_N_T_/"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "d9e53ad889b729eac9955a0ac4f25a19",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iFGJ9rUmIq_06R72t1nDu/_N_T_/_not-found"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "80539a004b3f4dcf41350d9c4bb1be76",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iFGJ9rUmIq_06R72t1nDu/_N_T_/_not-found/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "750d310e7928e677b35d274fe3a5c60a",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iFGJ9rUmIq_06R72t1nDu/_N_T_/_not-found/page"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "fea3cbe9b64f5e47b01b34b0557d5981",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iFGJ9rUmIq_06R72t1nDu/_N_T_/apple-icon.png"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "5ac6c0d64e3030bc08eaba5a15044808",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iFGJ9rUmIq_06R72t1nDu/_N_T_/apple-icon.png/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "8e48942f2299e9fb62b1f149e816f91f",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iFGJ9rUmIq_06R72t1nDu/_N_T_/apple-icon.png/route"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "82af0940fdf6af6a691b2670b5050d9f",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iFGJ9rUmIq_06R72t1nDu/_N_T_/favicon.ico"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "fe3aee6ab6fc25b3984dd1bc6bbbe2e0",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iFGJ9rUmIq_06R72t1nDu/_N_T_/favicon.ico/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "dd4f39c58a14cb903935eec08b25229a",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iFGJ9rUmIq_06R72t1nDu/_N_T_/favicon.ico/route"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "317e20a9eaab3bff211eab585fc73817",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iFGJ9rUmIq_06R72t1nDu/_N_T_/icon.svg"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "5ef787bfdcf94a35f51030b7eaeebb52",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iFGJ9rUmIq_06R72t1nDu/_N_T_/icon.svg/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "b97867a5da2361f122b096474a633abb",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iFGJ9rUmIq_06R72t1nDu/_N_T_/icon.svg/route"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "a7efd128c1738f958f394311954d5f47",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iFGJ9rUmIq_06R72t1nDu/_N_T_/layout-iFGJ9rUmIq_06R72t1nDu/_not-found"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "90e8c0cc642f18ddfe02059531174db7",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iFGJ9rUmIq_06R72t1nDu/_N_T_/layout-iFGJ9rUmIq_06R72t1nDu/apple-icon.png"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "1c9ad2b267daf69a930137086e046b8b",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iFGJ9rUmIq_06R72t1nDu/_N_T_/layout-iFGJ9rUmIq_06R72t1nDu/favicon.ico"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "6be575da61b78e80af48d4235951621a",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iFGJ9rUmIq_06R72t1nDu/_N_T_/layout-iFGJ9rUmIq_06R72t1nDu/icon.svg"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "b81c461c45632b6772d72051e48d3506",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iFGJ9rUmIq_06R72t1nDu/_N_T_/layout-iFGJ9rUmIq_06R72t1nDu/index"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "bd1feb1ff9d4c1e442b4216619e151a6",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iFGJ9rUmIq_06R72t1nDu/_N_T_/layout-iFGJ9rUmIq_06R72t1nDu/sitemap.xml"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "3dad1a222dbfc0476475b378a10dcf2f",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iFGJ9rUmIq_06R72t1nDu/_N_T_/page"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "dcbae6fc61a585384975da045b5b1ca6",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iFGJ9rUmIq_06R72t1nDu/_N_T_/sitemap.xml"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "c1a7269c780f94bb24452c7c5c380137",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iFGJ9rUmIq_06R72t1nDu/_N_T_/sitemap.xml/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "4b173348b2bacd2eecac8e430a1b480b",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["iFGJ9rUmIq_06R72t1nDu/_N_T_/sitemap.xml/route"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "bbe529a5ba1011c2b89809ec2d6c7521",
        ]
    }

  # module.single_zone.module.image_optimisation_function[0].aws_lambda_function.lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "lambda_function" {
        id                             = "vltech-website-image-optimization-function"
      ~ last_modified                  = "2025-02-14T12:13:15.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:9" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:9/invocations" -> (known after apply)
      ~ source_code_hash               = "ed01x7tXB2pZdISANA7WyBT9u+JbrG1+gGvgIWvx8SU=" -> "D7zfmSxmCHeilj0vztDAq+LVrjShuMXMVMRGBz1ktNE="
        tags                           = {}
      ~ version                        = "9" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.single_zone.module.image_optimisation_function[0].terraform_data.update_alias[0] must be replaced
-/+ resource "terraform_data" "update_alias" {
      ~ id               = "c861c6ea-fca5-3db8-a533-7b8aec2118ce" -> (known after apply)
      ~ triggers_replace = [
          ~ "9" -> (known after apply),
            "nextjs",
        ]
    }

  # module.single_zone.module.revalidation_function.aws_lambda_function.lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "lambda_function" {
        id                             = "vltech-website-revalidation-function"
      ~ last_modified                  = "2025-02-14T12:13:05.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-revalidation-function:9" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-revalidation-function:9/invocations" -> (known after apply)
      ~ source_code_hash               = "rscBgPnYQK9Yl75uk1e/36SBTG21miRIsBkx/l5o30w=" -> "oRSi8xCu1gOtpbyn/MBsPFKT8/jH/0hu9NDLR+XoZBU="
        tags                           = {}
      ~ version                        = "9" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.single_zone.module.revalidation_function.terraform_data.update_alias[0] must be replaced
-/+ resource "terraform_data" "update_alias" {
      ~ id               = "a6c5f47c-3c6f-57b1-0b03-e087f7d6719c" -> (known after apply)
      ~ triggers_replace = [
          ~ "9" -> (known after apply),
            "stable",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["920w1QLo2qpKniSWhIQ1q/500.cache"] will be destroyed
  # (because key ["920w1QLo2qpKniSWhIQ1q/500.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "4e661c2a-5354-ee7d-81b3-22f2df1dd72a" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "9a14a6a4c0d9ba71aeeaf64d0e3b1ca4",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["920w1QLo2qpKniSWhIQ1q/_not-found.cache"] will be destroyed
  # (because key ["920w1QLo2qpKniSWhIQ1q/_not-found.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "e792b735-3e9a-be2d-71b4-25c4731245fc" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "d7d8a71f2a06d32e7a8195952d77e4ae",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["920w1QLo2qpKniSWhIQ1q/apple-icon.png.cache"] will be destroyed
  # (because key ["920w1QLo2qpKniSWhIQ1q/apple-icon.png.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "4ab22298-1947-a0a3-cc33-d814e62a661e" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "9843a61c98627e227286769373becd10",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["920w1QLo2qpKniSWhIQ1q/favicon.ico.cache"] will be destroyed
  # (because key ["920w1QLo2qpKniSWhIQ1q/favicon.ico.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "f64b397c-c23c-8f76-46e8-4c81cc6cd3f0" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "1253a11e7fded511c766a255028ab4ee",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["920w1QLo2qpKniSWhIQ1q/icon.svg.cache"] will be destroyed
  # (because key ["920w1QLo2qpKniSWhIQ1q/icon.svg.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "8948703b-a2b3-650c-5a25-5389c6fa5441" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "31e8b96a370a0c0409d732d5d9c1d2d6",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["920w1QLo2qpKniSWhIQ1q/index.cache"] will be destroyed
  # (because key ["920w1QLo2qpKniSWhIQ1q/index.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "2ed45707-57ac-52a1-1332-235c4359661f" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "f9840ccd4e9eb7750ca05fd935697983",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["920w1QLo2qpKniSWhIQ1q/sitemap.xml.cache"] will be destroyed
  # (because key ["920w1QLo2qpKniSWhIQ1q/sitemap.xml.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "1c369268-3fd5-e077-1a09-3815d80ee7d7" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "f6542859cf54fff88cb47b171341d92e",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["BUILD_ID"] must be replaced
-/+ resource "terraform_data" "file_sync" {
      ~ id               = "fd6eb316-4119-0da6-a5e6-ceef61c1e285" -> (known after apply)
      ~ triggers_replace = [
            # (1 unchanged element hidden)
            "nextjs",
          ~ "c08399e37f452c433fe33cde99331ae6" -> "1bdbf5c04cf1185f8f907ad4ce86bdb4",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/920w1QLo2qpKniSWhIQ1q/_buildManifest.js"] will be destroyed
  # (because key ["_next/static/920w1QLo2qpKniSWhIQ1q/_buildManifest.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "0a04cc66-2256-b7a6-5893-5ca384300b1c" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "892a9747d43e4b601f00a11fefa35b56",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/920w1QLo2qpKniSWhIQ1q/_ssgManifest.js"] will be destroyed
  # (because key ["_next/static/920w1QLo2qpKniSWhIQ1q/_ssgManifest.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "128a8f55-1249-23ff-7b5f-1b2608667000" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "b404e23d62d95bafd03ad7747cc0e88b",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/iFGJ9rUmIq_06R72t1nDu/_buildManifest.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "892a9747d43e4b601f00a11fefa35b56",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/iFGJ9rUmIq_06R72t1nDu/_ssgManifest.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "b404e23d62d95bafd03ad7747cc0e88b",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["iFGJ9rUmIq_06R72t1nDu/500.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "94aa75badc6244bf48914c0c83f8e012",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["iFGJ9rUmIq_06R72t1nDu/_not-found.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "af9fdb44f3499225c5a28859c4520aaa",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["iFGJ9rUmIq_06R72t1nDu/apple-icon.png.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "9843a61c98627e227286769373becd10",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["iFGJ9rUmIq_06R72t1nDu/favicon.ico.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "1253a11e7fded511c766a255028ab4ee",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["iFGJ9rUmIq_06R72t1nDu/icon.svg.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "31e8b96a370a0c0409d732d5d9c1d2d6",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["iFGJ9rUmIq_06R72t1nDu/index.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "8ad169a27759dcefc810c540a270fd5d",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["iFGJ9rUmIq_06R72t1nDu/sitemap.xml.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "f719c6bd483ffc7f948746cbaaf70468",
        ]
    }

  # module.single_zone.module.server_function.aws_lambda_function.lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "lambda_function" {
        id                             = "vltech-website-server-function"
      ~ last_modified                  = "2025-02-14T12:13:25.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:9" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:9/invocations" -> (known after apply)
      ~ source_code_hash               = "gzK80VzSZwObIn2OrCguZzOt+rZ4IfGhm0cCYKqnZcg=" -> "YjXI7zI4Gp0l7q3qJRt00zTAhpSaouI99lsEnt+JLOM="
        tags                           = {}
      ~ version                        = "9" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.single_zone.module.server_function.terraform_data.update_alias[0] must be replaced
-/+ resource "terraform_data" "update_alias" {
      ~ id               = "fd943bb0-7ec6-03d0-ecbc-1166987a6b53" -> (known after apply)
      ~ triggers_replace = [
          ~ "9" -> (known after apply),
            "nextjs",
        ]
    }

Plan: 36 to add, 3 to change, 36 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @dependabot[bot], Action: `pull_request`, Working Directory: `terraform`, Workflow: `PR Checks`*